{
  " ": 32,
  "!": 33,
  "\"": 34,
  "#": 35,
  "$": 36,
  "%": 37,
  "&": 38,
  "'": 39,
  "(": 40,
  ")": 41,
  "*": 42,
  "+": 43,
  ",": 44,
  "-": 45,
  ".": 46,
  "/": 47,
  "0": 48,
  "1": 49,
  "2": 50,
  "3": 51,
  "4": 52,
  "5": 53,
  "6": 54,
  "7": 55,
  "8": 56,
  "9": 57,
  ":": 58,
  ";": 59,
  "<": 60,
  "<byte_127>": 127,
  "<byte_128>": 128,
  "<byte_129>": 129,
  "<byte_130>": 130,
  "<byte_131>": 131,
  "<byte_132>": 132,
  "<byte_133>": 133,
  "<byte_134>": 134,
  "<byte_135>": 135,
  "<byte_136>": 136,
  "<byte_137>": 137,
  "<byte_138>": 138,
  "<byte_139>": 139,
  "<byte_140>": 140,
  "<byte_141>": 141,
  "<byte_142>": 142,
  "<byte_143>": 143,
  "<byte_144>": 144,
  "<byte_145>": 145,
  "<byte_146>": 146,
  "<byte_147>": 147,
  "<byte_148>": 148,
  "<byte_149>": 149,
  "<byte_150>": 150,
  "<byte_151>": 151,
  "<byte_152>": 152,
  "<byte_153>": 153,
  "<byte_154>": 154,
  "<byte_155>": 155,
  "<byte_156>": 156,
  "<byte_157>": 157,
  "<byte_158>": 158,
  "<byte_159>": 159,
  "<byte_160>": 160,
  "<byte_161>": 161,
  "<byte_162>": 162,
  "<byte_163>": 163,
  "<byte_164>": 164,
  "<byte_165>": 165,
  "<byte_166>": 166,
  "<byte_167>": 167,
  "<byte_168>": 168,
  "<byte_169>": 169,
  "<byte_170>": 170,
  "<byte_171>": 171,
  "<byte_172>": 172,
  "<byte_173>": 173,
  "<byte_174>": 174,
  "<byte_175>": 175,
  "<byte_176>": 176,
  "<byte_177>": 177,
  "<byte_178>": 178,
  "<byte_179>": 179,
  "<byte_180>": 180,
  "<byte_181>": 181,
  "<byte_182>": 182,
  "<byte_183>": 183,
  "<byte_184>": 184,
  "<byte_185>": 185,
  "<byte_186>": 186,
  "<byte_187>": 187,
  "<byte_188>": 188,
  "<byte_189>": 189,
  "<byte_190>": 190,
  "<byte_191>": 191,
  "<byte_192>": 192,
  "<byte_193>": 193,
  "<byte_194>": 194,
  "<byte_195>": 195,
  "<byte_196>": 196,
  "<byte_197>": 197,
  "<byte_198>": 198,
  "<byte_199>": 199,
  "<byte_200>": 200,
  "<byte_201>": 201,
  "<byte_202>": 202,
  "<byte_203>": 203,
  "<byte_204>": 204,
  "<byte_205>": 205,
  "<byte_206>": 206,
  "<byte_207>": 207,
  "<byte_208>": 208,
  "<byte_209>": 209,
  "<byte_210>": 210,
  "<byte_211>": 211,
  "<byte_212>": 212,
  "<byte_213>": 213,
  "<byte_214>": 214,
  "<byte_215>": 215,
  "<byte_216>": 216,
  "<byte_217>": 217,
  "<byte_218>": 218,
  "<byte_219>": 219,
  "<byte_220>": 220,
  "<byte_221>": 221,
  "<byte_222>": 222,
  "<byte_223>": 223,
  "<byte_224>": 224,
  "<byte_225>": 225,
  "<byte_226>": 226,
  "<byte_227>": 227,
  "<byte_228>": 228,
  "<byte_229>": 229,
  "<byte_230>": 230,
  "<byte_231>": 231,
  "<byte_232>": 232,
  "<byte_233>": 233,
  "<byte_234>": 234,
  "<byte_235>": 235,
  "<byte_236>": 236,
  "<byte_237>": 237,
  "<byte_238>": 238,
  "<byte_239>": 239,
  "<byte_240>": 240,
  "<byte_241>": 241,
  "<byte_242>": 242,
  "<byte_243>": 243,
  "<byte_244>": 244,
  "<byte_245>": 245,
  "<byte_246>": 246,
  "<byte_247>": 247,
  "<byte_248>": 248,
  "<byte_249>": 249,
  "<byte_250>": 250,
  "<byte_251>": 251,
  "<byte_252>": 252,
  "<byte_253>": 253,
  "<byte_254>": 254,
  "<byte_255>": 255,
  "<byte_256>": 256,
  "<byte_257>": 257,
  "<byte_258>": 258,
  "<byte_259>": 259,
  "<byte_260>": 260,
  "<byte_261>": 261,
  "<byte_262>": 262,
  "<byte_263>": 263,
  "<byte_264>": 264,
  "<byte_265>": 265,
  "<byte_266>": 266,
  "<byte_267>": 267,
  "<byte_268>": 268,
  "<byte_269>": 269,
  "<byte_270>": 270,
  "<byte_271>": 271,
  "<byte_272>": 272,
  "<byte_273>": 273,
  "<byte_274>": 274,
  "<byte_275>": 275,
  "<byte_276>": 276,
  "<byte_277>": 277,
  "<byte_278>": 278,
  "<byte_279>": 279,
  "<byte_280>": 280,
  "<byte_281>": 281,
  "<byte_282>": 282,
  "<byte_283>": 283,
  "<byte_284>": 284,
  "<byte_285>": 285,
  "<byte_286>": 286,
  "<byte_287>": 287,
  "<byte_288>": 288,
  "<byte_289>": 289,
  "<byte_290>": 290,
  "<byte_291>": 291,
  "<byte_292>": 292,
  "<byte_293>": 293,
  "<byte_294>": 294,
  "<byte_295>": 295,
  "<byte_296>": 296,
  "<byte_297>": 297,
  "<byte_298>": 298,
  "<byte_299>": 299,
  "<byte_300>": 300,
  "<byte_301>": 301,
  "<byte_302>": 302,
  "<byte_303>": 303,
  "<byte_304>": 304,
  "<byte_305>": 305,
  "<byte_306>": 306,
  "<byte_307>": 307,
  "<byte_308>": 308,
  "<byte_309>": 309,
  "<byte_310>": 310,
  "<byte_311>": 311,
  "<byte_312>": 312,
  "<byte_313>": 313,
  "<byte_314>": 314,
  "<byte_315>": 315,
  "<byte_316>": 316,
  "<byte_317>": 317,
  "<byte_318>": 318,
  "<byte_319>": 319,
  "<byte_320>": 320,
  "<byte_321>": 321,
  "<byte_322>": 322,
  "<byte_323>": 323,
  "<byte_324>": 324,
  "<byte_325>": 325,
  "<byte_326>": 326,
  "<byte_327>": 327,
  "<byte_328>": 328,
  "<byte_329>": 329,
  "<byte_330>": 330,
  "<byte_331>": 331,
  "<byte_332>": 332,
  "<byte_333>": 333,
  "<byte_334>": 334,
  "<byte_335>": 335,
  "<byte_336>": 336,
  "<byte_337>": 337,
  "<byte_338>": 338,
  "<byte_339>": 339,
  "<byte_340>": 340,
  "<byte_341>": 341,
  "<byte_342>": 342,
  "<byte_343>": 343,
  "<byte_344>": 344,
  "<byte_345>": 345,
  "<byte_346>": 346,
  "<byte_347>": 347,
  "<byte_348>": 348,
  "<byte_349>": 349,
  "<byte_350>": 350,
  "<byte_351>": 351,
  "<byte_352>": 352,
  "<byte_353>": 353,
  "<byte_354>": 354,
  "<byte_355>": 355,
  "<byte_356>": 356,
  "<byte_357>": 357,
  "<byte_358>": 358,
  "<byte_359>": 359,
  "<byte_360>": 360,
  "<byte_361>": 361,
  "<byte_362>": 362,
  "<byte_363>": 363,
  "<byte_364>": 364,
  "<byte_365>": 365,
  "<byte_366>": 366,
  "<byte_367>": 367,
  "<byte_368>": 368,
  "<byte_369>": 369,
  "<byte_370>": 370,
  "<byte_371>": 371,
  "<byte_372>": 372,
  "<byte_373>": 373,
  "<byte_374>": 374,
  "<byte_375>": 375,
  "<byte_376>": 376,
  "<byte_377>": 377,
  "<byte_378>": 378,
  "<byte_379>": 379,
  "<byte_380>": 380,
  "<byte_381>": 381,
  "<byte_382>": 382,
  "<byte_383>": 383,
  "<byte_384>": 384,
  "<byte_385>": 385,
  "<byte_386>": 386,
  "<byte_387>": 387,
  "<byte_388>": 388,
  "<byte_389>": 389,
  "<byte_390>": 390,
  "<byte_391>": 391,
  "<byte_392>": 392,
  "<byte_393>": 393,
  "<byte_394>": 394,
  "<byte_395>": 395,
  "<byte_396>": 396,
  "<byte_397>": 397,
  "<byte_398>": 398,
  "<byte_399>": 399,
  "<byte_400>": 400,
  "<byte_401>": 401,
  "<byte_402>": 402,
  "<byte_403>": 403,
  "<byte_404>": 404,
  "<byte_405>": 405,
  "<byte_406>": 406,
  "<byte_407>": 407,
  "<byte_408>": 408,
  "<byte_409>": 409,
  "<byte_410>": 410,
  "<byte_411>": 411,
  "<byte_412>": 412,
  "<byte_413>": 413,
  "<byte_414>": 414,
  "<byte_415>": 415,
  "<byte_416>": 416,
  "<byte_417>": 417,
  "<byte_418>": 418,
  "<byte_419>": 419,
  "<byte_420>": 420,
  "<byte_421>": 421,
  "<byte_422>": 422,
  "<byte_423>": 423,
  "<byte_424>": 424,
  "<byte_425>": 425,
  "<byte_426>": 426,
  "<byte_427>": 427,
  "<byte_428>": 428,
  "<byte_429>": 429,
  "<byte_430>": 430,
  "<byte_431>": 431,
  "<byte_432>": 432,
  "<byte_433>": 433,
  "<byte_434>": 434,
  "<byte_435>": 435,
  "<byte_436>": 436,
  "<byte_437>": 437,
  "<byte_438>": 438,
  "<byte_439>": 439,
  "<byte_440>": 440,
  "<byte_441>": 441,
  "<byte_442>": 442,
  "<byte_443>": 443,
  "<byte_444>": 444,
  "<byte_445>": 445,
  "<byte_446>": 446,
  "<byte_447>": 447,
  "<byte_448>": 448,
  "<byte_449>": 449,
  "<byte_450>": 450,
  "<byte_451>": 451,
  "<byte_452>": 452,
  "<byte_453>": 453,
  "<byte_454>": 454,
  "<byte_455>": 455,
  "<byte_456>": 456,
  "<byte_457>": 457,
  "<byte_458>": 458,
  "<byte_459>": 459,
  "<byte_460>": 460,
  "<byte_461>": 461,
  "<byte_462>": 462,
  "<byte_463>": 463,
  "<byte_464>": 464,
  "<byte_465>": 465,
  "<byte_466>": 466,
  "<byte_467>": 467,
  "<byte_468>": 468,
  "<byte_469>": 469,
  "<byte_470>": 470,
  "<byte_471>": 471,
  "<byte_472>": 472,
  "<byte_473>": 473,
  "<byte_474>": 474,
  "<byte_475>": 475,
  "<byte_476>": 476,
  "<byte_477>": 477,
  "<byte_478>": 478,
  "<byte_479>": 479,
  "<byte_480>": 480,
  "<byte_481>": 481,
  "<byte_482>": 482,
  "<byte_483>": 483,
  "<byte_484>": 484,
  "<byte_485>": 485,
  "<byte_486>": 486,
  "<byte_487>": 487,
  "<byte_488>": 488,
  "<byte_489>": 489,
  "<byte_490>": 490,
  "<byte_491>": 491,
  "<byte_492>": 492,
  "<byte_493>": 493,
  "<byte_494>": 494,
  "<byte_495>": 495,
  "<byte_496>": 496,
  "<byte_497>": 497,
  "<byte_498>": 498,
  "<byte_499>": 499,
  "<byte_500>": 500,
  "<byte_501>": 501,
  "<byte_502>": 502,
  "<byte_503>": 503,
  "<byte_504>": 504,
  "<byte_505>": 505,
  "<byte_506>": 506,
  "<byte_507>": 507,
  "<byte_508>": 508,
  "<byte_509>": 509,
  "<byte_510>": 510,
  "<byte_511>": 511,
  "<eos>": 0,
  "<pad>": 1,
  "<unk>": 2,
  "=": 61,
  ">": 62,
  "?": 63,
  "@": 64,
  "A": 65,
  "B": 66,
  "C": 67,
  "D": 68,
  "E": 69,
  "F": 70,
  "G": 71,
  "H": 72,
  "I": 73,
  "J": 74,
  "K": 75,
  "L": 76,
  "M": 77,
  "N": 78,
  "O": 79,
  "P": 80,
  "Q": 81,
  "R": 82,
  "S": 83,
  "T": 84,
  "U": 85,
  "V": 86,
  "W": 87,
  "X": 88,
  "Y": 89,
  "Z": 90,
  "[": 91,
  "\\": 92,
  "]": 93,
  "^": 94,
  "_": 95,
  "`": 96,
  "a": 97,
  "b": 98,
  "c": 99,
  "d": 100,
  "e": 101,
  "f": 102,
  "g": 103,
  "h": 104,
  "i": 105,
  "j": 106,
  "k": 107,
  "l": 108,
  "m": 109,
  "n": 110,
  "o": 111,
  "p": 112,
  "q": 113,
  "r": 114,
  "s": 115,
  "t": 116,
  "u": 117,
  "v": 118,
  "w": 119,
  "x": 120,
  "y": 121,
  "z": 122,
  "{": 123,
  "|": 124,
  "}": 125,
  "~": 126
}
